In [2]:
import pandas as pd

# Create a DataFrame with dummy data.
df = pd.DataFrame(data={'staff_no': [9999] * 5,
                        'name': ['Dean McGrath'] * 5,
                        'year': [2016, 2017, 2018, 2019, 2020],
                        'hours': [349, 231, 876, 679, 976]})

In [3]:
df

   staff_no          name  year  hours
0      9999  Dean McGrath  2016    349
1      9999  Dean McGrath  2017    231
2      9999  Dean McGrath  2018    876
3      9999  Dean McGrath  2019    679
4      9999  Dean McGrath  2020    976

In [5]:
df_new=df[['staff_no','year','hours','name']]
df_new

   staff_no  year  hours          name
0      9999  2016    349  Dean McGrath
1      9999  2017    231  Dean McGrath
2      9999  2018    876  Dean McGrath
3      9999  2019    679  Dean McGrath
4      9999  2020    976  Dean McGrath